Repository: JoaoFelipe/prov-survey
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: pt_br

source: Start
pt_br: Começar

source: Restart
pt_br: Recomeçar

source: Next
pt_br: Avançar

source: No schooling completed
pt_br: Nenhuma

source: Primary School in progress
pt_br: Ensino Fundamental em andamento

source: Primary School
pt_br: Ensino Fundamental

source: Secondary Education in progress
pt_br: Ensino Médio em andamento

source: Secondary Education
pt_br: Ensino Médio

source: Associate degree in progress
pt_br: Ensino Técnico em andamento

source: Associate degree
pt_br: Ensino Técnico

source: Undergraduate degree in progress
pt_br: Ensino Superior em andamento

source: Undergraduate degree
pt_br: Ensino Superior

source: Masters degree in progress
pt_br: Mestrado em andamento

source: Masters degree
pt_br: Mestrado

source: PhD degree in progress
pt_br: Doutorado em andamento

source: PhD degree
pt_br: Doutorado completo

source: 2 to 5
pt_br: 2 a 5

source: 5 to 10
pt_br: 5 a 10

source: More than 10
pt_br: Mais de 1

source: Less than 1 year
pt_br: Menos do que 1 ano

source: Between 1 and 2 years
pt_br: Entre 1 e 2 anos

source: Between 2 and 5 years
pt_br: Entre 2 e 5 anos

source: Between 5 and 7 years
pt_br: Entre 5 e 7 anos

source: Between 7 and 12 years
pt_br: Entre 7 e 12 anos

source: More than 12 years
pt_br: Mais do que 12 anos

source: Undergraduate Research
pt_br: Iniciação científica

source: Undergraduate Courses
pt_br: Graduação

source: Graduate or Postgraduate Research
pt_br: Pós-graduação

source: Research (University)
pt_br: Pesquisa (Universidade)

source: Research (Company)
pt_br: Pesquisa (Empresa)

source: Other(s)
pt_br: Outro(s)

source: Specify
pt_br: Especifique

source: Workflow Management Systems (eg.: VisTrails, Taverna, Kepler, SciCumulus, etc)
pt_br: Sistemas de Gerência de Workflow Científico (Ex.: VisTrails, Taverna, Kepler, SciCumulus, etc)

source: Script Languages (eg.: Python, R, JavaScript, Julia, Matlab, etc)
pt_br: Linguagens de Script (Ex.: Python, R, JavaScript, Julia, Matlab, etc)

source: System Programing languages (eg.: Java, C, C++, Fortran, Object Pascal, etc)
pt_br: Linguagens de Programação de Sistemas (Ex.: Java, C, C++, Fortran, Object Pascal, etc)

source: Other(s)2
pt_br: Outra(s)

source: Workflow Management Systems
pt_br: Sistemas de Gerência de Workflow Científico

source: Script Languages
pt_br: Linguagens de Script

source: System Programming Languages
pt_br: Linguagens de Programação de Sistema

source: I do not have preferences
pt_br: Não tenho preferência

source: Easy to set up and run
pt_br: Facilidade para a configuração e execução do experimento

source: Flexible development/modification
pt_br: Flexibilidade na construção/modificação do experimento

source: Provenance capture support
pt_br: Suporte à captura da proveniência

source: Provenance analysis support
pt_br: Suporte à análise da proveniência

source: Previous experience (know-how)
pt_br: Experiência prévia

source: Helping/Supporting facilities
pt_br: Facilidade de ajuda/suporte

source: Easy to learn
pt_br: Facilidade no aprendizado

source: Documentation facilities
pt_br: Facilidade de documentação

source: Easy to share
pt_br: Facilidade de compartilhamento

source: Easy to reproduce
pt_br: Reprodutibilidade do experimento

source: Yes
pt_br: Sim

source: No
pt_br: Não

source: I do not know what is provenance
pt_br: Não sei o que é proveniência

source: Deadline
pt_br: Prazo

source: I do not see any utility
pt_br: Não vejo utilidade

source: I do not have the appropriate tools
pt_br: Não tenho ferramentas apropriadas

source: I do not have enough knowledge
pt_br: Não tenho conhecimento necessário

source: I did not collect the provenance
pt_br: A captura de proveniência não foi realizada

source: I did not reach the analysis phase
pt_br: Não cheguei na etapa de análise

source: Yes, I have used distinct Workflow Management Systems
pt_br: Sim, utilizei Sistemas de Gerência de Workflow Científico distintos

source: Yes, I have used distinct Script Languages
pt_br: Sim, utilizei Linguagens de Script distintas

source: Yes, I have used distinct System Programming Languages
pt_br: Sim, utilizei Linguagens de Programação de Sistemas distintas

source: Yes, I have used Workflow Management Systems and Script Languages
pt_br: Sim, utilizei Sistemas de Gerência de Workflow Científico e Linguagens de Script

source: Yes, I have used Workflow Management Systems and System Programming Languages
pt_br: Sim, utilizei Sistemas de Gerência de Workflow Científico e Linguagens de Programação de Sistemas

source: Yes, I have used Script Languages and System Programming Languages
pt_br: Sim, utilizei Linguagens de Script e Linguagens de Programação de sistemas

source: Yes, I have used all types of tools
pt_br: Sim, utilizei todos os tipos de ferramentas computacionais

source: No, I have never combined multiple tools
pt_br: Não, nunca combinei ferramentas distintas

source: You must specify the email!
pt_br: Você deve especificar o e-mail!

source: The email must be valid!
pt_br: O e-mail deve ser válido!

source: Finish
pt_br: Finalizar

source: Start2
pt_br: Início

source: Invalid Session. Restarting
pt_br: Sessão inválida. Reiniciando

source: ~1 minute remaining
pt_br: ~1 minuto restante

source: ~%(minutes)s minutes remaining
pt_br: ~%(minutes)s minutos restantes

source: What is your educational level?
pt_br: Qual é a sua escolaridade?

source: How many scientific experiments have you ever performed on computational environments?
pt_br: Quantos experimentos científicos você já realizou em ambientes computacionais?

source: How much experience do you have in running scientific experiments on computational environments?
pt_br: Quanto tempo de experiência você possui com experimentos científicos em ambientes computacionais?

source: In which situations have you performed computational experiments? (check all that apply)
pt_br: Em que contextos você já realizou experimentos computacionais? (marque todas as respostas que se aplicam)

source: Which computational tools have you ever used to run your experiments? (check all that apply)
pt_br: Quais ferramentas computacionais você já utilizou para executar seus experimentos? (marque todas as respostas que se aplicam)

source: Which Workflow Management Systems have you ever used to run scientific experiments (check all that apply)
pt_br: Quais Sistemas de Gerência de Workflow Científico você já utilizou na execução de experimentos científicos? (marque todas as respostas que se aplicam)

source: Which Script Languages have you ever used to run scientific experiments (check all that apply)
pt_br: Quais Linguagens de Script você já utilizou na execução de experimentos científicos? (marque todas as respostas que se aplicam)

source: Which is your favorite tool for developing and running scientific experiments?
pt_br: Qual sua ferramenta predileta para o desenvolvimento e execução de experimentos científicos?

source: What are the reasons for your preference? (check all that apply)
pt_br: Quais os motivos da sua preferência por esta ferramenta? (marque todas as respostas que se aplicam)

source: Have you ever analyzed provenance generated from the execution of scientific experiments?
pt_br: Você já analisou a proveniência gerada pela execução do experimento?

source: Why did you not analyze provenance data? (check all that apply)
pt_br: Por quais motivos você não analisou os dados de proveniência? (marque todas as respostas que se aplicam)

source: Which tools/languages have you ever used to analyze provenance? (check all that apply)
pt_br: Quais ferramentas/linguagens você já utilizou para analisar a proveniência? (marque todas as respostas que se aplicam)

source: Have you ever used more than one tool in a single experiment?
pt_br: Você já utilizou mais de uma ferramenta computacional num mesmo experimento?

source: In your understanding, when two team execute variations of a given experiment, is there any advantage in performing a joint analysis of these experiments, by comparing result data, methods, duration, and/or used parameters?
pt_br: No seu entendimento, quando duas equipes executam variações de um mesmo experimentos, haveria algum ganho em realizar análise conjunta desses experimentos, comparando dados como resultados, métodos, tempo e/ou parâmetros utilizados?

source: Have you ever analyzed (or had to analyze) two or more provenance databases generated by variations of a given experiment together? Note that different teams with different machines might have executed these experiments, or a single person might have executed the variations.
pt_br: Você já analisou (ou precisou analisar) em conjunto duas ou mais bases de proveniência geradas por variações de um mesmo experimento? Note que esses experimentos podem ter sido executados em sistemas diferentes, por equipes diferentes, ou podem ser simplesmente variações do mesmo experimento.

source: These experiments were executed in different tools?
pt_br: Estes experimentos foram executados em ferramentas computacionais diferentes?

source: Would you accept being contacted about the possibility of participating in a practical experimental study about integrated provenance analysis? The study is in the context of a PhD thesis about provenance integration.
pt_br: Você aceitaria ser contatado sobre a possibilidade de participar de um estudo experimental prático sobre análise integrada de proveniência? O estudo faz parte do contexto de uma tese de doutorado sobre integração de proveniência.

source: Would you accept being contacted to clarify some details about the answers you provided in this survey?
pt_br: Você aceitaria ser contatado para esclarecer alguns detalhes sobre as respostas que você forneceu nesse questionário?

source: Please, enter your email so we can contact you.
pt_br: Por favor, informe seu e-mail para que possamos contatá-lo.

source: Thank you
pt_br: Obrigado

source: Computational Experiments Survey
pt_br: Questionário sobre Experimentos Computacionais

source: Any questions or problems please report to %(wellmor)s or %(jpimentel)s.
pt_br: Em caso de dúvidas quanto ao preenchimento favor enviar e-mail para %(wellmor)s ou %(jpimentel)s

source: Thank you for the answers!
pt_br: Obrigado pelas respostas!

source: Hello,
pt_br: Olá,

source: We are doing a survey to identify computational tools and technologies most used to design, execute, and analyze scientific experiments. For this, we would like to invite you to collaborate by answer a questionnaire with multiple choice options. Some questions require additional information. The estimated time for answering is around XX minutes. This survey was designed by PhD students of Computing Science from Universidade Federal Fluminense (UFF).
pt_br: Estamos executando um survey para identificar as principais ferramentas e tecnologias computacionais utilizadas no projeto, execução e análise de experimentos científicos. Para isso, gostaríamos da sua colaboração, preenchendo um questionário composto por questões de múltipla escolha. Algumas questões requerem alguma informação adicional. O tempo estimado de preenchimento é 8 minutos. Este questionário foi elaborado por alunos do curso de Doutorado em Computação da Universidade Federal Fluminense (UFF).
